---
kind: type
id: T:Autodesk.Revit.DB.ThermalProperties
source: html/bfab51b3-ecd9-a082-9604-bf916248ca63.htm
---
# Autodesk.Revit.DB.ThermalProperties

Class specific to thermal properties for assembly types, such as Wall,
 Floor, Ceiling, Roof and Building Pad.

## Syntax (C#)
```csharp
public class ThermalProperties : APIObject
```